XYZUtils.XYZ.unit
make this a unit vector or return ERR_NULL_VECTOR

XYZUtils.XYZ.#ctor(System.Double,System.Double,System.Double)
construct XYZ from components

XYZUtils.XYZ.#ctor(System.Double!System.Runtime.CompilerServices.IsConst*)
construct XYZ from Vec3d